/* Автогенерировано: scripts/fetch-its.mjs — не редактировать вручную. */
import type { ItsDataset } from './its';

export const ITS_DATASET: ItsDataset = {
  "codes": {
    "420292": {
      "hs6": "420292",
      "period": "2021",
      "value": 566615673.84,
      "kg": 57211518,
      "units": 57211518
    },
    "610910": {
      "hs6": "610910",
      "period": "2021",
      "value": 1175792971.83,
      "kg": 63220899,
      "units": 485035974
    },
    "640299": {
      "hs6": "640299",
      "period": "2021",
      "value": 1110204979.11,
      "kg": 118458113,
      "units": 197582458
    },
    "847130": {
      "hs6": "847130",
      "period": "2021",
      "value": 6654612576.88,
      "kg": 29604052,
      "units": 15776614
    },
    "871200": {
      "hs6": "871200",
      "period": "2021",
      "value": 424993386.84,
      "kg": 85110555,
      "units": 5918288
    },
    "940169": {
      "hs6": "940169",
      "period": "2021",
      "value": 56403756.75,
      "kg": 15012225,
      "units": 3034884
    },
    "940179": {
      "hs6": "940179",
      "period": "2021",
      "value": 149801235.31,
      "kg": 45793560,
      "units": 13425602
    },
    "950300": {
      "hs6": "950300",
      "period": "2021",
      "value": 2847414666.99,
      "kg": 322393690,
      "units": 322393690
    },
    "950510": {
      "hs6": "950510",
      "period": "2021",
      "value": 238600411.42,
      "kg": 35253910,
      "units": 35253910
    }
  },
  "meta": {
    "period": "2021",
    "source": "UN Comtrade: средняя цена импорта в РФ (последний открытый год официальной статистики)",
    "generatedAt": "2026-10-26T07:41:17.019Z"
  }
} as ItsDataset;
